#include <stdio.h>
/*
通过指针参数，传入主调函数中两个变量的地址，并修改地址所对应的值，结果 能交换 主调函数中两个变量的值。
    结果：
转换之前 x = 10 ,y = 5,x的地址为：000000000061FE08,y的地址为000000000061FE0C
*****************************************************
转换之前 u = 6422024 ,v = 6422028,u的地址为：000000000061FDD0,v的地址为000000000061FDD8
*****************************************************
转换之后 u = 6422024 ,v = 6422028,u的地址为：000000000061FDD0,v的地址为000000000061FDD8
**********************************************************
转换之后 x = 5 ,y = 10,x的地址为：000000000061FE08,y的地址为000000000061FE0C
*/
void swap(int *u, int *v);
int main()
{
    int x = 10, y = 5;
    printf("转换之前 x = %d ,y = %d,x的地址为：%p,y的地址为%p\n", x, y, &x, &y);
    swap(&x, &y);
    printf("**********************************************************\n");
    printf("转换之后 x = %d ,y = %d,x的地址为：%p,y的地址为%p\n", x, y, &x, &y);
}
void swap(int *u, int *v)
{
    printf("*****************************************************\n");
    printf("转换之前 u = %d ,v = %d,u的地址为：%p,v的地址为%p\n", u, v, &u, &v);
    int temp;
    temp = *u;
    *u = *v;
    *v = temp;
    printf("*****************************************************\n");
    printf("转换之后 u = %d ,v = %d,u的地址为：%p,v的地址为%p\n", u, v, &u, &v);
}